micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32n6xx_ll_bus.h
  * @author  MCD Application Team
  * @brief   Header file of BUS LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB & APB peripherals, 1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_LL_BUS_H
#define STM32N6xx_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx.h"

/** @addtogroup STM32N6xx_LL_Driver
  * @{
  */
#if defined(RCC)

/** @defgroup BUS_LL BUS
  * @{
  */

/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Constants BUS Exported Constants
  * @{
  */

/** @defgroup BUS_LL_EC_AXI  AXI
  * @{
  */
#define LL_ACLKN                           RCC_BUSENR_ACLKNEN
#define LL_ACLKNC                          RCC_BUSENR_ACLKNCEN
#define LL_AHBM                            RCC_BUSENR_AHBMEN
#define LL_AHB1                            RCC_BUSENR_AHB1EN
#define LL_AHB2                            RCC_BUSENR_AHB2EN
#define LL_AHB3                            RCC_BUSENR_AHB3EN
#define LL_AHB4                            RCC_BUSENR_AHB4EN
#define LL_AHB5                            RCC_BUSENR_AHB5EN
#define LL_APB1                            RCC_BUSENR_APB1EN
#define LL_APB2                            RCC_BUSENR_APB2EN
#define LL_APB3                            RCC_BUSENR_APB3EN
#define LL_APB4                            RCC_BUSENR_APB4EN
#define LL_APB5                            RCC_BUSENR_APB5EN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_MEM  MEM
  * @{
  */
#define LL_MEM_AXISRAM1                    RCC_MEMENR_AXISRAM1EN
#define LL_MEM_AXISRAM2                    RCC_MEMENR_AXISRAM2EN
#define LL_MEM_AXISRAM3                    RCC_MEMENR_AXISRAM3EN
#define LL_MEM_AXISRAM4                    RCC_MEMENR_AXISRAM4EN
#define LL_MEM_AXISRAM5                    RCC_MEMENR_AXISRAM5EN
#define LL_MEM_AXISRAM6                    RCC_MEMENR_AXISRAM6EN
#define LL_MEM_AHBSRAM1                    RCC_MEMENR_AHBSRAM1EN
#define LL_MEM_AHBSRAM2                    RCC_MEMENR_AHBSRAM2EN
#define LL_MEM_BKPSRAM                     RCC_MEMENR_BKPSRAMEN
#define LL_MEM_FLEXRAM                     RCC_MEMENR_FLEXRAMEN
#define LL_MEM_CACHEAXIRAM                 RCC_MEMENR_CACHEAXIRAMEN
#define LL_MEM_VENCRAM                     RCC_MEMENR_VENCRAMEN
#define LL_MEM_BOOTROM                     RCC_MEMENR_BOOTROMEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB1_GRP1_PERIPH  AHB1 GRP1 PERIPH
  * @{
  */
#define LL_AHB1_GRP1_PERIPH_ADC12          RCC_AHB1ENR_ADC12EN
#define LL_AHB1_GRP1_PERIPH_GPDMA1         RCC_AHB1ENR_GPDMA1EN
#define LL_AHB1_GRP1_PERIPH_ALL            (LL_AHB1_GRP1_PERIPH_ADC12 | LL_AHB1_GRP1_PERIPH_GPDMA1)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB2_GRP1_PERIPH  AHB2 GRP1 PERIPH
  * @{
  */
#define LL_AHB2_GRP1_PERIPH_ADF1           RCC_AHB2ENR_ADF1EN
#define LL_AHB2_GRP1_PERIPH_MDF1           RCC_AHB2ENR_MDF1EN
#define LL_AHB2_GRP1_PERIPH_RAMCFG         RCC_AHB2ENR_RAMCFGEN
#define LL_AHB2_GRP1_PERIPH_ALL            (LL_AHB2_GRP1_PERIPH_ADF1 | LL_AHB2_GRP1_PERIPH_MDF1 | \
                                            LL_AHB2_GRP1_PERIPH_RAMCFG)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB3_GRP1_PERIPH  AHB3 GRP1 PERIPH
  * @{
  */
#if defined(CRYP)
#define LL_AHB3_GRP1_PERIPH_CRYP           RCC_AHB3ENR_CRYPEN
#else
#define LL_AHB3_GRP1_PERIPH_CRYP
#endif /* CRYP */
#define LL_AHB3_GRP1_PERIPH_HASH           RCC_AHB3ENR_HASHEN
#define LL_AHB3_GRP1_PERIPH_IAC            RCC_AHB3ENR_IACEN
#if defined(PKA)
#define LL_AHB3_GRP1_PERIPH_PKA            RCC_AHB3ENR_PKAEN
#else
#define LL_AHB3_GRP1_PERIPH_PKA
#endif /* PKA */
#define LL_AHB3_GRP1_PERIPH_RIFSC          RCC_AHB3ENR_RIFSCEN
#define LL_AHB3_GRP1_PERIPH_RISAF          RCC_AHB3ENR_RISAFEN
#define LL_AHB3_GRP1_PERIPH_RNG            RCC_AHB3ENR_RNGEN
#if defined(SAES)
#define LL_AHB3_GRP1_PERIPH_SAES           RCC_AHB3ENR_SAESEN
#else
#define LL_AHB3_GRP1_PERIPH_SAES
#endif /* SAES */
#define LL_AHB3_GRP1_PERIPH_ALL            (LL_AHB3_GRP1_PERIPH_CRYP  | LL_AHB3_GRP1_PERIPH_HASH  | \
                                            LL_AHB3_GRP1_PERIPH_IAC   | LL_AHB3_GRP1_PERIPH_PKA   | \
                                            LL_AHB3_GRP1_PERIPH_RIFSC | LL_AHB3_GRP1_PERIPH_RISAF | \
                                            LL_AHB3_GRP1_PERIPH_RNG   | LL_AHB3_GRP1_PERIPH_SAES)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB4_GRP1_PERIPH  AHB4 GRP1 PERIPH
  * @{
  */
#define LL_AHB4_GRP1_PERIPH_CRC            RCC_AHB4ENR_CRCEN
#define LL_AHB4_GRP1_PERIPH_GPIOA          RCC_AHB4ENR_GPIOAEN
#define LL_AHB4_GRP1_PERIPH_GPIOB          RCC_AHB4ENR_GPIOBEN
#define LL_AHB4_GRP1_PERIPH_GPIOC          RCC_AHB4ENR_GPIOCEN
#define LL_AHB4_GRP1_PERIPH_GPIOD          RCC_AHB4ENR_GPIODEN
#define LL_AHB4_GRP1_PERIPH_GPIOE          RCC_AHB4ENR_GPIOEEN
#define LL_AHB4_GRP1_PERIPH_GPIOF          RCC_AHB4ENR_GPIOFEN
#define LL_AHB4_GRP1_PERIPH_GPIOG          RCC_AHB4ENR_GPIOGEN
#define LL_AHB4_GRP1_PERIPH_GPIOH          RCC_AHB4ENR_GPIOHEN
#define LL_AHB4_GRP1_PERIPH_GPION          RCC_AHB4ENR_GPIONEN
#define LL_AHB4_GRP1_PERIPH_GPIOO          RCC_AHB4ENR_GPIOOEN
#define LL_AHB4_GRP1_PERIPH_GPIOP          RCC_AHB4ENR_GPIOPEN
#define LL_AHB4_GRP1_PERIPH_GPIOQ          RCC_AHB4ENR_GPIOQEN
#define LL_AHB4_GRP1_PERIPH_PWR            RCC_AHB4ENR_PWREN
#define LL_AHB4_GRP1_PERIPH_ALL            (LL_AHB4_GRP1_PERIPH_CRC   | LL_AHB4_GRP1_PERIPH_GPIOA | \
                                            LL_AHB4_GRP1_PERIPH_GPIOB | LL_AHB4_GRP1_PERIPH_GPIOC | \
                                            LL_AHB4_GRP1_PERIPH_GPIOD | LL_AHB4_GRP1_PERIPH_GPIOE | \
                                            LL_AHB4_GRP1_PERIPH_GPIOF | LL_AHB4_GRP1_PERIPH_GPIOG | \
                                            LL_AHB4_GRP1_PERIPH_GPIOH | LL_AHB4_GRP1_PERIPH_GPION | \
                                            LL_AHB4_GRP1_PERIPH_GPIOO | LL_AHB4_GRP1_PERIPH_GPIOP | \
                                            LL_AHB4_GRP1_PERIPH_GPIOQ | LL_AHB4_GRP1_PERIPH_PWR)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB5_GRP1_PERIPH  AHB5 GRP1 PERIPH
  * @{
  */
#define LL_AHB5_GRP1_PERIPH_DMA2D             RCC_AHB5ENR_DMA2DEN
#define LL_AHB5_GRP1_PERIPH_ETH1              RCC_AHB5ENR_ETH1EN
#define LL_AHB5_GRP1_PERIPH_ETH1MAC           RCC_AHB5ENR_ETH1MACEN
#define LL_AHB5_GRP1_PERIPH_ETH1TX            RCC_AHB5ENR_ETH1TXEN
#define LL_AHB5_GRP1_PERIPH_ETH1RX            RCC_AHB5ENR_ETH1RXEN
#define LL_AHB5_GRP1_PERIPH_FMC               RCC_AHB5ENR_FMCEN
#define LL_AHB5_GRP1_PERIPH_GFXMMU            RCC_AHB5ENR_GFXMMUEN
#define LL_AHB5_GRP1_PERIPH_GPU2D             RCC_AHB5ENR_GPU2DEN
#define LL_AHB5_GRP1_PERIPH_HPDMA1            RCC_AHB5ENR_HPDMA1EN
#define LL_AHB5_GRP1_PERIPH_XSPI1             RCC_AHB5ENR_XSPI1EN
#define LL_AHB5_GRP1_PERIPH_XSPI2             RCC_AHB5ENR_XSPI2EN
#define LL_AHB5_GRP1_PERIPH_XSPI3             RCC_AHB5ENR_XSPI3EN
#define LL_AHB5_GRP1_PERIPH_XSPIM             RCC_AHB5ENR_XSPIMEN
#define LL_AHB5_GRP1_PERIPH_JPEG              RCC_AHB5ENR_JPEGEN
#define LL_AHB5_GRP1_PERIPH_MCE1              RCC_AHB5ENR_MCE1EN
#define LL_AHB5_GRP1_PERIPH_MCE2              RCC_AHB5ENR_MCE2EN
#define LL_AHB5_GRP1_PERIPH_MCE3              RCC_AHB5ENR_MCE3EN
#define LL_AHB5_GRP1_PERIPH_MCE4              RCC_AHB5ENR_MCE4EN
#define LL_AHB5_GRP1_PERIPH_CACHEAXI          RCC_AHB5ENR_CACHEAXIEN
#define LL_AHB5_GRP1_PERIPH_NPU               RCC_AHB5ENR_NPUEN
#define LL_AHB5_GRP1_PERIPH_OTG1              RCC_AHB5ENR_OTG1EN
#define LL_AHB5_GRP1_PERIPH_OTG2              RCC_AHB5ENR_OTG2EN
#define LL_AHB5_GRP1_PERIPH_OTGPHY1           RCC_AHB5ENR_OTGPHY1EN
#define LL_AHB5_GRP1_PERIPH_OTGPHY2           RCC_AHB5ENR_OTGPHY2EN
#define LL_AHB5_GRP1_PERIPH_OTG1PHYCTL        RCC_AHB5RSTR_OTG1PHYCTLRST
#define LL_AHB5_GRP1_PERIPH_OTG2PHYCTL        RCC_AHB5RSTR_OTG2PHYCTLRST
#define LL_AHB5_GRP1_PERIPH_PSSI              RCC_AHB5ENR_PSSIEN
#define LL_AHB5_GRP1_PERIPH_SDMMC1            RCC_AHB5ENR_SDMMC1EN
#define LL_AHB5_GRP1_PERIPH_SDMMC2            RCC_AHB5ENR_SDMMC2EN
#define LL_AHB5_GRP1_PERIPH_ALL            (LL_AHB5_GRP1_PERIPH_DMA2D    | LL_AHB5_GRP1_PERIPH_ETH1    | \
                                            LL_AHB5_GRP1_PERIPH_ETH1MAC  | LL_AHB5_GRP1_PERIPH_ETH1TX  | \
                                            LL_AHB5_GRP1_PERIPH_ETH1RX   | LL_AHB5_GRP1_PERIPH_FMC     | \
                                            LL_AHB5_GRP1_PERIPH_GFXMMU   | LL_AHB5_GRP1_PERIPH_GPU2D   | \
                                            LL_AHB5_GRP1_PERIPH_HPDMA1   | LL_AHB5_GRP1_PERIPH_XSPI1   | \
                                            LL_AHB5_GRP1_PERIPH_XSPI2    | LL_AHB5_GRP1_PERIPH_XSPI3   | \
                                            LL_AHB5_GRP1_PERIPH_XSPIM    | LL_AHB5_GRP1_PERIPH_JPEG    | \
                                            LL_AHB5_GRP1_PERIPH_MCE1     | LL_AHB5_GRP1_PERIPH_MCE2    | \
                                            LL_AHB5_GRP1_PERIPH_MCE3     | LL_AHB5_GRP1_PERIPH_MCE4    | \
                                            LL_AHB5_GRP1_PERIPH_CACHEAXI | LL_AHB5_GRP1_PERIPH_NPU     | \
                                            LL_AHB5_GRP1_PERIPH_OTG1     | LL_AHB5_GRP1_PERIPH_OTG2    | \
                                            LL_AHB5_GRP1_PERIPH_OTGPHY1  | LL_AHB5_GRP1_PERIPH_OTGPHY2 | \
                                            LL_AHB5_GRP1_PERIPH_PSSI     | LL_AHB5_GRP1_PERIPH_SDMMC1  | \
                                            LL_AHB5_GRP1_PERIPH_SDMMC2)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB1_GRP1_PERIPH  APB1 GRP1 PERIPH
  * @{
  */
#define LL_APB1_GRP1_PERIPH_I2C1           RCC_APB1ENR1_I2C1EN
#define LL_APB1_GRP1_PERIPH_I2C2           RCC_APB1ENR1_I2C2EN
#define LL_APB1_GRP1_PERIPH_I2C3           RCC_APB1ENR1_I2C3EN
#define LL_APB1_GRP1_PERIPH_I3C1           RCC_APB1ENR1_I3C1EN
#define LL_APB1_GRP1_PERIPH_I3C2           RCC_APB1ENR1_I3C2EN
#define LL_APB1_GRP1_PERIPH_LPTIM1         RCC_APB1ENR1_LPTIM1EN
#define LL_APB1_GRP1_PERIPH_SPDIFRX1       RCC_APB1ENR1_SPDIFRX1EN
#define LL_APB1_GRP1_PERIPH_SPI2           RCC_APB1ENR1_SPI2EN
#define LL_APB1_GRP1_PERIPH_SPI3           RCC_APB1ENR1_SPI3EN
#define LL_APB1_GRP1_PERIPH_TIM2           RCC_APB1ENR1_TIM2EN
#define LL_APB1_GRP1_PERIPH_TIM3           RCC_APB1ENR1_TIM3EN
#define LL_APB1_GRP1_PERIPH_TIM4           RCC_APB1ENR1_TIM4EN
#define LL_APB1_GRP1_PERIPH_TIM5           RCC_APB1ENR1_TIM5EN
#define LL_APB1_GRP1_PERIPH_TIM6           RCC_APB1ENR1_TIM6EN
#define LL_APB1_GRP1_PERIPH_TIM7           RCC_APB1ENR1_TIM7EN
#define LL_APB1_GRP1_PERIPH_TIM10          RCC_APB1ENR1_TIM10EN
#define LL_APB1_GRP1_PERIPH_TIM11          RCC_APB1ENR1_TIM11EN
#define LL_APB1_GRP1_PERIPH_TIM12          RCC_APB1ENR1_TIM12EN
#define LL_APB1_GRP1_PERIPH_TIM13          RCC_APB1ENR1_TIM13EN
#define LL_APB1_GRP1_PERIPH_TIM14          RCC_APB1ENR1_TIM14EN
#define LL_APB1_GRP1_PERIPH_USART2         RCC_APB1ENR1_USART2EN
#define LL_APB1_GRP1_PERIPH_USART3         RCC_APB1ENR1_USART3EN
#define LL_APB1_GRP1_PERIPH_UART4          RCC_APB1ENR1_UART4EN
#define LL_APB1_GRP1_PERIPH_UART5          RCC_APB1ENR1_UART5EN
#define LL_APB1_GRP1_PERIPH_UART7          RCC_APB1ENR1_UART7EN
#define LL_APB1_GRP1_PERIPH_UART8          RCC_APB1ENR1_UART8EN
#define LL_APB1_GRP1_PERIPH_WWDG           RCC_APB1ENR1_WWDGEN
#define LL_APB1_GRP1_PERIPH_ALL            (LL_APB1_GRP1_PERIPH_I2C1     | LL_APB1_GRP1_PERIPH_I2C2   | \
                                            LL_APB1_GRP1_PERIPH_I2C3     | LL_APB1_GRP1_PERIPH_I3C1   | \
                                            LL_APB1_GRP1_PERIPH_I3C2     | LL_APB1_GRP1_PERIPH_LPTIM1 | \
                                            LL_APB1_GRP1_PERIPH_SPDIFRX1 | LL_APB1_GRP1_PERIPH_SPI2   | \
                                            LL_APB1_GRP1_PERIPH_SPI3     | LL_APB1_GRP1_PERIPH_TIM2   | \
                                            LL_APB1_GRP1_PERIPH_TIM3     | LL_APB1_GRP1_PERIPH_TIM4   | \
                                            LL_APB1_GRP1_PERIPH_TIM5     | LL_APB1_GRP1_PERIPH_TIM6   | \
                                            LL_APB1_GRP1_PERIPH_TIM7     | LL_APB1_GRP1_PERIPH_TIM10  | \
                                            LL_APB1_GRP1_PERIPH_TIM11    | LL_APB1_GRP1_PERIPH_TIM12  | \
                                            LL_APB1_GRP1_PERIPH_TIM13    | LL_APB1_GRP1_PERIPH_TIM14  | \
                                            LL_APB1_GRP1_PERIPH_USART2   | LL_APB1_GRP1_PERIPH_USART3 | \
                                            LL_APB1_GRP1_PERIPH_UART4    | LL_APB1_GRP1_PERIPH_UART5  | \
                                            LL_APB1_GRP1_PERIPH_UART7    | LL_APB1_GRP1_PERIPH_UART8  | \
                                            LL_APB1_GRP1_PERIPH_WWDG)
/**
  * @}
  */

