micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/** @defgroup BUS_LL_EC_APB1_GRP2_PERIPH  APB1 GRP2 PERIPH
  * @{
  */
#define LL_APB1_GRP2_PERIPH_FDCAN          RCC_APB1ENR2_FDCANEN
#define LL_APB1_GRP2_PERIPH_MDIOS          RCC_APB1ENR2_MDIOSEN
#define LL_APB1_GRP2_PERIPH_UCPD1          RCC_APB1ENR2_UCPD1EN
#define LL_APB1_GRP2_PERIPH_ALL            (LL_APB1_GRP2_PERIPH_FDCAN | LL_APB1_GRP2_PERIPH_MDIOS | \
                                            LL_APB1_GRP2_PERIPH_UCPD1)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
#define LL_APB2_GRP1_PERIPH_SAI1           RCC_APB2ENR_SAI1EN
#define LL_APB2_GRP1_PERIPH_SAI2           RCC_APB2ENR_SAI2EN
#define LL_APB2_GRP1_PERIPH_SPI1           RCC_APB2ENR_SPI1EN
#define LL_APB2_GRP1_PERIPH_SPI4           RCC_APB2ENR_SPI4EN
#define LL_APB2_GRP1_PERIPH_SPI5           RCC_APB2ENR_SPI5EN
#define LL_APB2_GRP1_PERIPH_TIM1           RCC_APB2ENR_TIM1EN
#define LL_APB2_GRP1_PERIPH_TIM8           RCC_APB2ENR_TIM8EN
#define LL_APB2_GRP1_PERIPH_TIM9           RCC_APB2ENR_TIM9EN
#define LL_APB2_GRP1_PERIPH_TIM15          RCC_APB2ENR_TIM15EN
#define LL_APB2_GRP1_PERIPH_TIM16          RCC_APB2ENR_TIM16EN
#define LL_APB2_GRP1_PERIPH_TIM17          RCC_APB2ENR_TIM17EN
#define LL_APB2_GRP1_PERIPH_TIM18          RCC_APB2ENR_TIM18EN
#define LL_APB2_GRP1_PERIPH_USART1         RCC_APB2ENR_USART1EN
#define LL_APB2_GRP1_PERIPH_USART6         RCC_APB2ENR_USART6EN
#define LL_APB2_GRP1_PERIPH_UART9          RCC_APB2ENR_UART9EN
#define LL_APB2_GRP1_PERIPH_USART10        RCC_APB2ENR_USART10EN
#define LL_APB2_GRP1_PERIPH_ALL            (LL_APB2_GRP1_PERIPH_SAI1   | LL_APB2_GRP1_PERIPH_SAI2   | \
                                            LL_APB2_GRP1_PERIPH_SPI1   | LL_APB2_GRP1_PERIPH_SPI4   | \
                                            LL_APB2_GRP1_PERIPH_SPI5   | LL_APB2_GRP1_PERIPH_TIM1   | \
                                            LL_APB2_GRP1_PERIPH_TIM8   | LL_APB2_GRP1_PERIPH_TIM9   | \
                                            LL_APB2_GRP1_PERIPH_TIM15  | LL_APB2_GRP1_PERIPH_TIM16  | \
                                            LL_APB2_GRP1_PERIPH_TIM17  | LL_APB2_GRP1_PERIPH_TIM18  | \
                                            LL_APB2_GRP1_PERIPH_USART1 | LL_APB2_GRP1_PERIPH_USART6 | \
                                            LL_APB2_GRP1_PERIPH_UART9  | LL_APB2_GRP1_PERIPH_USART10)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB4_GRP1_PERIPH  APB4 GRP1 PERIPH
  * @{
  */
#define LL_APB4_GRP1_PERIPH_HDP            RCC_APB4ENR1_HDPEN
#define LL_APB4_GRP1_PERIPH_I2C4           RCC_APB4ENR1_I2C4EN
#define LL_APB4_GRP1_PERIPH_LPTIM2         RCC_APB4ENR1_LPTIM2EN
#define LL_APB4_GRP1_PERIPH_LPTIM3         RCC_APB4ENR1_LPTIM3EN
#define LL_APB4_GRP1_PERIPH_LPTIM4         RCC_APB4ENR1_LPTIM4EN
#define LL_APB4_GRP1_PERIPH_LPTIM5         RCC_APB4ENR1_LPTIM5EN
#define LL_APB4_GRP1_PERIPH_LPUART1        RCC_APB4ENR1_LPUART1EN
#define LL_APB4_GRP1_PERIPH_RTC            RCC_APB4ENR1_RTCEN
#define LL_APB4_GRP1_PERIPH_RTCAPB         RCC_APB4ENR1_RTCAPBEN
#define LL_APB4_GRP1_PERIPH_SPI6           RCC_APB4ENR1_SPI6EN
#define LL_APB4_GRP1_PERIPH_VREFBUF        RCC_APB4ENR1_VREFBUFEN
#define LL_APB4_GRP1_PERIPH_ALL            (LL_APB4_GRP1_PERIPH_HDP     | LL_APB4_GRP1_PERIPH_I2C4    | \
                                            LL_APB4_GRP1_PERIPH_LPTIM2  | LL_APB4_GRP1_PERIPH_LPTIM3  | \
                                            LL_APB4_GRP1_PERIPH_LPTIM4  | LL_APB4_GRP1_PERIPH_LPTIM5  | \
                                            LL_APB4_GRP1_PERIPH_LPUART1 | LL_APB4_GRP1_PERIPH_RTC     | \
                                            LL_APB4_GRP1_PERIPH_RTCAPB  | LL_APB4_GRP1_PERIPH_SPI6    | \
                                            LL_APB4_GRP1_PERIPH_VREFBUF)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB4_GRP2_PERIPH  APB4 GRP2 PERIPH
  * @{
  */
#define LL_APB4_GRP2_PERIPH_BSEC           RCC_APB4ENR2_BSECEN
#define LL_APB4_GRP2_PERIPH_DTS            RCC_APB4ENR2_DTSEN
#define LL_APB4_GRP2_PERIPH_SYSCFG         RCC_APB4ENR2_SYSCFGEN
#define LL_APB4_GRP2_PERIPH_ALL            (LL_APB4_GRP2_PERIPH_BSEC | LL_APB4_GRP2_PERIPH_DTS | \
                                            LL_APB4_GRP2_PERIPH_SYSCFG)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB5_GRP1_PERIPH  APB5 GRP1 PERIPH
  * @{
  */
#define LL_APB5_GRP1_PERIPH_CSI            RCC_APB5ENR_CSIEN
#define LL_APB5_GRP1_PERIPH_DCMIPP         RCC_APB5ENR_DCMIPPEN
#define LL_APB5_GRP1_PERIPH_GFXTIM         RCC_APB5ENR_GFXTIMEN
#define LL_APB5_GRP1_PERIPH_LTDC           RCC_APB5ENR_LTDCEN
#if defined(VENC)
#define LL_APB5_GRP1_PERIPH_VENC           RCC_APB5ENR_VENCEN
#else
#define LL_APB5_GRP1_PERIPH_VENC
#endif /* VENC */
#define LL_APB5_GRP1_PERIPH_ALL            (LL_APB5_GRP1_PERIPH_CSI    | LL_APB5_GRP1_PERIPH_DCMIPP | \
                                            LL_APB5_GRP1_PERIPH_GFXTIM | LL_APB5_GRP1_PERIPH_LTDC   | \
                                            LL_APB5_GRP1_PERIPH_VENC)
/**
  * @}
  */

/** @defgroup BUS_LL_EC_MISC  MISC
  * @{
  */
#define LL_DBG                             RCC_MISCENR_DBGEN
#define LL_MCO1                            RCC_MISCENR_MCO1EN
#define LL_MCO2                            RCC_MISCENR_MCO2EN
#define LL_XSPIPHYCOMP                     RCC_MISCENR_XSPIPHYCOMPEN
#define LL_XSPIPHY1                        RCC_MISCRSTR_XSPIPHY1RST
#define LL_XSPIPHY2                        RCC_MISCRSTR_XSPIPHY2RST
#define LL_PER                             RCC_MISCENR_PEREN
#define LL_SDMMC1DLL                       RCC_MISCRSTR_SDMMC1DLLRST
#define LL_SDMMC2DLL                       RCC_MISCRSTR_SDMMC2DLLRST
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/

/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_BUS BUS
  * @{
  */

/**
  * @brief  Enable AXI bus clock.
  * @rmtoll BUSENSR      ACLKNENS      LL_BUS_EnableClock\n
  *         BUSENSR      ACLKNCENS     LL_BUS_EnableClock\n
  *         BUSENSR      AHBMENS       LL_BUS_EnableClock\n
  *         BUSENSR      AHB1ENS       LL_BUS_EnableClock\n
  *         BUSENSR      AHB2ENS       LL_BUS_EnableClock\n
  *         BUSENSR      AHB3ENS       LL_BUS_EnableClock\n
  *         BUSENSR      AHB4ENS       LL_BUS_EnableClock\n
  *         BUSENSR      AHB5ENS       LL_BUS_EnableClock\n
  *         BUSENSR      APB1ENS       LL_BUS_EnableClock\n
  *         BUSENSR      APB2ENS       LL_BUS_EnableClock\n
  *         BUSENSR      APB3ENS       LL_BUS_EnableClock\n
  *         BUSENSR      APB4ENS       LL_BUS_EnableClock\n
  *         BUSENSR      APB5ENS       LL_BUS_EnableClock
  * @param  Bus This parameter can be a combination of the following values:
  *         @arg @ref LL_ACLKN
  *         @arg @ref LL_ACLKNC
  *         @arg @ref LL_AHBM
  *         @arg @ref LL_AHB1
  *         @arg @ref LL_AHB2
  *         @arg @ref LL_AHB3
  *         @arg @ref LL_AHB4
  *         @arg @ref LL_AHB5
  *         @arg @ref LL_APB1
  *         @arg @ref LL_APB2
  *         @arg @ref LL_APB3
  *         @arg @ref LL_APB4
  *         @arg @ref LL_APB5
  * @retval None
  */
__STATIC_INLINE void LL_BUS_EnableClock(uint32_t Bus)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->BUSENSR, Bus);
  /* Delay after an RCC bus clock enabling */
  tmpreg = READ_REG(RCC->BUSENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AXI bus clock is enabled or not
  * @rmtoll BUSENR       ACLKNEN       LL_BUS_IsEnabledClock\n
  *         BUSENR       ACLKNCEN      LL_BUS_IsEnabledClock\n
  *         BUSENR       AHBMEN        LL_BUS_IsEnabledClock\n
  *         BUSENR       AHB1EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       AHB2EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       AHB3EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       AHB4EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       AHB5EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       APB1EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       APB2EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       APB3EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       APB4EN        LL_BUS_IsEnabledClock\n
  *         BUSENR       APB5EN        LL_BUS_IsEnabledClock
  * @param  Bus This parameter can be a combination of the following values:
  *         @arg @ref LL_ACLKN
  *         @arg @ref LL_ACLKNC
  *         @arg @ref LL_AHBM
  *         @arg @ref LL_AHB1
  *         @arg @ref LL_AHB2
  *         @arg @ref LL_AHB3
  *         @arg @ref LL_AHB4
  *         @arg @ref LL_AHB5
  *         @arg @ref LL_APB1
  *         @arg @ref LL_APB2
  *         @arg @ref LL_APB3
  *         @arg @ref LL_APB4
  *         @arg @ref LL_APB5
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_BUS_IsEnabledClock(uint32_t Bus)
{
  return ((READ_BIT(RCC->BUSENR, Bus) == Bus) ? 1UL : 0UL);
}

/**
  * @brief  Disable AXI bus clock.
  * @rmtoll BUSENCR      ACLKNENC      LL_BUS_DisableClock\n
  *         BUSENCR      ACLKNCENC     LL_BUS_DisableClock\n
  *         BUSENCR      AHBMENC       LL_BUS_DisableClock\n
  *         BUSENCR      AHB1ENC       LL_BUS_DisableClock\n
  *         BUSENCR      AHB2ENC       LL_BUS_DisableClock\n
  *         BUSENCR      AHB3ENC       LL_BUS_DisableClock\n
  *         BUSENCR      AHB4ENC       LL_BUS_DisableClock\n
  *         BUSENCR      AHB5ENC       LL_BUS_DisableClock\n
  *         BUSENCR      APB1ENC       LL_BUS_DisableClock\n
  *         BUSENCR      APB2ENC       LL_BUS_DisableClock\n
  *         BUSENCR      APB3ENC       LL_BUS_DisableClock\n
  *         BUSENCR      APB4ENC       LL_BUS_DisableClock\n
  *         BUSENCR      APB5ENC       LL_BUS_DisableClock
  * @param  Bus This parameter can be a combination of the following values:
  *         @arg @ref LL_ACLKN
  *         @arg @ref LL_ACLKNC
  *         @arg @ref LL_AHBM
  *         @arg @ref LL_AHB1
  *         @arg @ref LL_AHB2
  *         @arg @ref LL_AHB3
  *         @arg @ref LL_AHB4
  *         @arg @ref LL_AHB5
  *         @arg @ref LL_APB1
  *         @arg @ref LL_APB2
  *         @arg @ref LL_APB3
  *         @arg @ref LL_APB4
  *         @arg @ref LL_APB5
  * @retval None
  */
__STATIC_INLINE void LL_BUS_DisableClock(uint32_t Bus)
{
  WRITE_REG(RCC->BUSENCR, Bus);
}

/**
  * @brief  Enable AXI bus clock during Low Power mode.
  * @rmtoll BUSLPENSR    ACLKNLPENS    LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    ACLKNCLPENS   LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    AHBMLPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    AHB1LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    AHB2LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    AHB3LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    AHB4LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    AHB5LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    APB1LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    APB2LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    APB3LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    APB4LPENS     LL_BUS_EnableClockLowPower\n
  *         BUSLPENSR    APB5LPENS     LL_BUS_EnableClockLowPower
  * @param  Bus This parameter can be a combination of the following values:
  *         @arg @ref LL_ACLKN
  *         @arg @ref LL_ACLKNC
  *         @arg @ref LL_AHBM
  *         @arg @ref LL_AHB1
  *         @arg @ref LL_AHB2
  *         @arg @ref LL_AHB3
  *         @arg @ref LL_AHB4
  *         @arg @ref LL_AHB5
  *         @arg @ref LL_APB1
  *         @arg @ref LL_APB2
  *         @arg @ref LL_APB3
  *         @arg @ref LL_APB4
  *         @arg @ref LL_APB5
  * @retval None
  */
__STATIC_INLINE void LL_BUS_EnableClockLowPower(uint32_t Bus)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->BUSLPENSR, Bus);
  /* Delay after an RCC bus clock enabling */
  tmpreg = READ_REG(RCC->BUSLPENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AXI bus clock during Low Power mode is enabled or not
  * @rmtoll BUSLPENR       ACLKNLPEN       LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       ACLKNCLPEN      LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       AHBMLPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       AHB1LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       AHB2LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       AHB3LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       AHB4LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       AHB5LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       APB1LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       APB2LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       APB3LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       APB4LPEN        LL_BUS_IsEnabledClockLowPower\n
  *         BUSLPENR       APB5LPEN        LL_BUS_IsEnabledClockLowPower
  * @param  Bus This parameter can be a combination of the following values:
  *         @arg @ref LL_ACLKN
  *         @arg @ref LL_ACLKNC
  *         @arg @ref LL_AHBM
  *         @arg @ref LL_AHB1
  *         @arg @ref LL_AHB2
  *         @arg @ref LL_AHB3
  *         @arg @ref LL_AHB4
  *         @arg @ref LL_AHB5
  *         @arg @ref LL_APB1
  *         @arg @ref LL_APB2
  *         @arg @ref LL_APB3
  *         @arg @ref LL_APB4
  *         @arg @ref LL_APB5
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_BUS_IsEnabledClockLowPower(uint32_t Bus)
{
  return ((READ_BIT(RCC->BUSLPENR, Bus) == Bus) ? 1UL : 0UL);
}

/**
  * @brief  Disable AXI bus clock during Low Power mode.
  * @rmtoll BUSLPENCR    ACLKNLPENC    LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    ACLKNCLPENC   LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    AHBMLPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    AHB1LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    AHB2LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    AHB3LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    AHB4LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    AHB5LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    APB1LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    APB2LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    APB3LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    APB4LPENC     LL_BUS_DisableClockLowPower\n
  *         BUSLPENCR    APB5LPENC     LL_BUS_DisableClockLowPower
  * @param  Bus This parameter can be a combination of the following values:
  *         @arg @ref LL_ACLKN
  *         @arg @ref LL_ACLKNC
  *         @arg @ref LL_AHBM
  *         @arg @ref LL_AHB1
  *         @arg @ref LL_AHB2
  *         @arg @ref LL_AHB3
  *         @arg @ref LL_AHB4
  *         @arg @ref LL_AHB5
  *         @arg @ref LL_APB1
  *         @arg @ref LL_APB2
  *         @arg @ref LL_APB3
  *         @arg @ref LL_APB4
  *         @arg @ref LL_APB5
  * @retval None
  */
__STATIC_INLINE void LL_BUS_DisableClockLowPower(uint32_t Bus)
{
  WRITE_REG(RCC->BUSLPENCR, Bus);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_MEM MEM
  * @{
  */

/**
  * @brief  Enable memories clock.
  * @rmtoll MEMENSR      AXISRAM1ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AXISRAM2ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AXISRAM3ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AXISRAM4ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AXISRAM5ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AXISRAM6ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AHBSRAM1ENS   LL_MEM_EnableClock\n
  *         MEMENSR      AHBSRAM2ENS   LL_MEM_EnableClock\n
  *         MEMENSR      BKPSRAMENS    LL_MEM_EnableClock\n
  *         MEMENSR      FLEXRAMENS    LL_MEM_EnableClock\n
  *         MEMENSR      CACHEAXIRAMENS LL_MEM_EnableClock\n
  *         MEMENSR      VENCRAMENS    LL_MEM_EnableClock
  * @param  Memories This parameter can be a combination of the following values:
  *         @arg @ref LL_MEM_AXISRAM1
  *         @arg @ref LL_MEM_AXISRAM2
  *         @arg @ref LL_MEM_AXISRAM3
  *         @arg @ref LL_MEM_AXISRAM4
  *         @arg @ref LL_MEM_AXISRAM5
  *         @arg @ref LL_MEM_AXISRAM6
  *         @arg @ref LL_MEM_AHBSRAM1
  *         @arg @ref LL_MEM_AHBSRAM2
  *         @arg @ref LL_MEM_BKPSRAM
  *         @arg @ref LL_MEM_FLEXRAM
  *         @arg @ref LL_MEM_CACHEAXIRAM
  *         @arg @ref LL_MEM_VENCRAM
  * @retval None
  */
__STATIC_INLINE void LL_MEM_EnableClock(uint32_t Memories)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MEMENSR, Memories);
  /* Delay after an RCC memories clock enabling */
  tmpreg = READ_REG(RCC->MEMENR);
  (void)tmpreg;
}

/**
  * @brief  Check if memory clock is enabled or not
  * @rmtoll MEMENR       AXISRAM1EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AXISRAM2EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AXISRAM3EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AXISRAM4EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AXISRAM5EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AXISRAM6EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AHBSRAM1EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       AHBSRAM2EN    LL_MEM_IsEnabledClock\n
  *         MEMENR       BKPSRAMEN     LL_MEM_IsEnabledClock\n
  *         MEMENR       FLEXRAMEN     LL_MEM_IsEnabledClock\n
  *         MEMENR       CACHEAXIRAMEN LL_MEM_IsEnabledClock\n
  *         MEMENR       VENCRAMEN     LL_MEM_IsEnabledClock
  * @param  Memories This parameter can be a combination of the following values:
  *         @arg @ref LL_MEM_AXISRAM1
  *         @arg @ref LL_MEM_AXISRAM2
  *         @arg @ref LL_MEM_AXISRAM3
  *         @arg @ref LL_MEM_AXISRAM4
  *         @arg @ref LL_MEM_AXISRAM5
  *         @arg @ref LL_MEM_AXISRAM6
  *         @arg @ref LL_MEM_AHBSRAM1
  *         @arg @ref LL_MEM_AHBSRAM2
  *         @arg @ref LL_MEM_BKPSRAM
  *         @arg @ref LL_MEM_FLEXRAM
  *         @arg @ref LL_MEM_CACHEAXIRAM
  *         @arg @ref LL_MEM_VENCRAM
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_MEM_IsEnabledClock(uint32_t Memories)
{
  return ((READ_BIT(RCC->MEMENR, Memories) == Memories) ? 1UL : 0UL);
}

/**
  * @brief  Disable memories clock.
  * @rmtoll MEMENCR      AXISRAM1ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AXISRAM2ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AXISRAM3ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AXISRAM4ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AXISRAM5ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AXISRAM6ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AHBSRAM1ENC   LL_MEM_DisableClock\n
  *         MEMENCR      AHBSRAM2ENC   LL_MEM_DisableClock\n
  *         MEMENCR      BKPSRAMENC    LL_MEM_DisableClock\n
  *         MEMENCR      FLEXRAMENC    LL_MEM_DisableClock\n
  *         MEMENCR      CACHEAXIRAMENC LL_MEM_DisableClock\n
  *         MEMENCR      VENCRAMENC    LL_MEM_DisableClock
  * @param  Memories This parameter can be a combination of the following values:
  *         @arg @ref LL_MEM_AXISRAM1
  *         @arg @ref LL_MEM_AXISRAM2
  *         @arg @ref LL_MEM_AXISRAM3
  *         @arg @ref LL_MEM_AXISRAM4
  *         @arg @ref LL_MEM_AXISRAM5
  *         @arg @ref LL_MEM_AXISRAM6
  *         @arg @ref LL_MEM_AHBSRAM1
  *         @arg @ref LL_MEM_AHBSRAM2
  *         @arg @ref LL_MEM_BKPSRAM
  *         @arg @ref LL_MEM_FLEXRAM
  *         @arg @ref LL_MEM_CACHEAXIRAM
  *         @arg @ref LL_MEM_VENCRAM
  * @retval None
  */
__STATIC_INLINE void LL_MEM_DisableClock(uint32_t Memories)
{
  WRITE_REG(RCC->MEMENCR, Memories);
}

/**
  * @brief  Enable memories clock during Low Power mode.
  * @rmtoll MEMLPENSR    AXISRAM1LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AXISRAM2LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AXISRAM3LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AXISRAM4LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AXISRAM5LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AXISRAM6LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AHBSRAM1LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    AHBSRAM2LPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    BKPSRAMLPENS  LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    FLEXRAMLPENS  LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    CACHEAXIRAMLPENS LL_MEM_EnableClockLowPower\n
  *         MEMLPENSR    VENCRAMLPENS  LL_MEM_EnableClockLowPower
  * @param  Memories This parameter can be a combination of the following values:
  *         @arg @ref LL_MEM_AXISRAM1
  *         @arg @ref LL_MEM_AXISRAM2
  *         @arg @ref LL_MEM_AXISRAM3
  *         @arg @ref LL_MEM_AXISRAM4
  *         @arg @ref LL_MEM_AXISRAM5
  *         @arg @ref LL_MEM_AXISRAM6
  *         @arg @ref LL_MEM_AHBSRAM1
  *         @arg @ref LL_MEM_AHBSRAM2
  *         @arg @ref LL_MEM_BKPSRAM
  *         @arg @ref LL_MEM_FLEXRAM
  *         @arg @ref LL_MEM_CACHEAXIRAM
  *         @arg @ref LL_MEM_VENCRAM
  * @retval None
  */
__STATIC_INLINE void LL_MEM_EnableClockLowPower(uint32_t Memories)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MEMLPENSR, Memories);
  /* Delay after an RCC memories clock enabling */
  tmpreg = READ_REG(RCC->MEMLPENR);
  (void)tmpreg;
}

/**
  * @brief  Check if memories clock during Low Power mode is enabled or not .
  * @rmtoll MEMLPENR      AXISRAM1LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AXISRAM2LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AXISRAM3LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AXISRAM4LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AXISRAM5LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AXISRAM6LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AHBSRAM1LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      AHBSRAM2LPEN    LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      BKPSRAMLPEN     LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      FLEXRAMLPEN     LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      CACHEAXIRAMLPEN LL_MEM_IsEnabledClockLowPower\n
  *         MEMLPENR      VENCRAMLPEN     LL_MEM_IsEnabledClockLowPower
  * @param  Memories This parameter can be a combination of the following values:
  *         @arg @ref LL_MEM_AXISRAM1
  *         @arg @ref LL_MEM_AXISRAM2
  *         @arg @ref LL_MEM_AXISRAM3
  *         @arg @ref LL_MEM_AXISRAM4
  *         @arg @ref LL_MEM_AXISRAM5
  *         @arg @ref LL_MEM_AXISRAM6
  *         @arg @ref LL_MEM_AHBSRAM1
  *         @arg @ref LL_MEM_AHBSRAM2
  *         @arg @ref LL_MEM_BKPSRAM
  *         @arg @ref LL_MEM_FLEXRAM
  *         @arg @ref LL_MEM_CACHEAXIRAM
  *         @arg @ref LL_MEM_VENCRAM
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MEM_IsEnabledClockLowPower(uint32_t Memories)
{
  return ((READ_BIT(RCC->MEMLPENR, Memories) == Memories) ? 1UL : 0UL);
}

