micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  * @brief  Disable memories clock during Low Power mode.
  * @rmtoll MEMLPENCR    AXISRAM1LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AXISRAM2LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AXISRAM3LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AXISRAM4LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AXISRAM5LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AXISRAM6LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AHBSRAM1LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    AHBSRAM2LPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    BKPSRAMLPENC  LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    FLEXRAMLPENC  LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    CACHEAXIRAMLPENC LL_MEM_DisableClockLowPower\n
  *         MEMLPENCR    VENCRAMLPENC  LL_MEM_DisableClockLowPower
  * @param  Memories This parameter can be a combination of the following values:
  *         @arg @ref LL_MEM_AXISRAM1
  *         @arg @ref LL_MEM_AXISRAM2
  *         @arg @ref LL_MEM_AXISRAM3
  *         @arg @ref LL_MEM_AXISRAM4
  *         @arg @ref LL_MEM_AXISRAM5
  *         @arg @ref LL_MEM_AXISRAM6
  *         @arg @ref LL_MEM_AHBSRAM1
  *         @arg @ref LL_MEM_AHBSRAM2
  *         @arg @ref LL_MEM_BKPSRAM
  *         @arg @ref LL_MEM_FLEXRAM
  *         @arg @ref LL_MEM_CACHEAXIRAM
  *         @arg @ref LL_MEM_VENCRAM
  * @retval None
  */
__STATIC_INLINE void LL_MEM_DisableClockLowPower(uint32_t Memories)
{
  WRITE_REG(RCC->MEMLPENCR, Memories);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB1 AHB1
  * @{
  */

/**
  * @brief  Enable AHB1 peripherals clock.
  * @rmtoll AHB1ENSR     GPDMA1ENS     LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENSR     ADC12ENS      LL_AHB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->AHB1ENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->AHB1ENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @rmtoll AHB1ENR      GPDMA1EN      LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR      ADC12EN       LL_AHB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @rmtoll AHB1ENCR     GPDMA1ENC     LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENCR     ADC12ENC      LL_AHB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB1ENCR, Periphs);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @rmtoll AHB1RSTSR    GPDMA1RSTS    LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTSR    ADC12RSTS     LL_AHB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB1RSTSR, Periphs);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @rmtoll AHB1RSTCR    GPDMA1RSTC    LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTCR    ADC12RSTC     LL_AHB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB1RSTCR, Periphs);
}

/**
  * @brief  Enable AHB1 peripherals clock during Low Power mode.
  * @rmtoll AHB1LPENSR   GPDMA1LPENS   LL_AHB1_GRP1_EnableClockLowPower\n
  *         AHB1LPENSR   ADC12LPENS    LL_AHB1_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->AHB1LPENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->AHB1LPENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll AHB1LPENR    GPDMA1LPEN    LL_AHB1_GRP1_IsEnabledClockLowPower\n
  *         AHB1LPENR    ADC12LPEN     LL_AHB1_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1LPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripherals clock during Low Power mode.
  * @rmtoll AHB1LPENCR   GPDMA1LPENC   LL_AHB1_GRP1_DisableClockLowPower\n
  *         AHB1LPENCR   ADC12LPENC    LL_AHB1_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADC12
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB1LPENCR, Periphs);
}

/**
  * @}
  */

