micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/** @defgroup BUS_LL_EF_AHB4 AHB4
  * @{
  */

/**
  * @brief  Enable AHB4 peripherals clock.
  * @rmtoll AHB4ENSR     GPIOAENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOBENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOCENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIODENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOEENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOFENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOGENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOHENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIONENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOOENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOPENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     GPIOQENS      LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     PWRENS        LL_AHB4_GRP1_EnableClock\n
  *         AHB4ENSR     CRCENS        LL_AHB4_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->AHB4ENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->AHB4ENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB4 peripheral clock is enabled or not
  * @rmtoll AHB4ENR      GPIOAEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOBEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOCEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIODEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOEEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOFEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOGEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOHEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIONEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOOEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOPEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      GPIOQEN       LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      PWREN         LL_AHB4_GRP1_IsEnabledClock\n
  *         AHB4ENR      CRCEN         LL_AHB4_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB4_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB4ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB4 peripherals clock.
  * @rmtoll AHB4ENCR     GPIOAENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOBENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOCENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIODENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOEENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOFENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOGENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOHENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIONENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOOENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOPENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     GPIOQENC      LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     PWRENC        LL_AHB4_GRP1_DisableClock\n
  *         AHB4ENCR     CRCENC        LL_AHB4_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB4ENCR, Periphs);
}

/**
  * @brief  Force AHB4 peripherals reset.
  * @rmtoll AHB4RSTSR     GPIOARSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOBRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOCRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIODRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOERSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOFRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOGRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOHRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIONRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOORSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOPRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     GPIOQRSTS      LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     CRCRSTS        LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSR     BKPRAMRSTS     LL_AHB4_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB4RSTSR, Periphs);
}

/**
  * @brief  Release AHB4 peripherals reset.
  * @rmtoll AHB4RSTCR     GPIOARSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOBRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOCRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIODRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOERSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOFRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOGRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOHRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIONRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOORSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOPRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     GPIOQRSTC      LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     CRCRSTC        LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCR     BKPRAMRSTC     LL_AHB4_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB4RSTCR, Periphs);
}

/**
  * @brief  Enable AHB4 peripherals clock during Low Power mode.
  * @rmtoll AHB4LPENSR    GPIOALPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOBLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOCLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIODLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOELPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOFLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOGLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOHLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIONLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOOLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOPLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    GPIOQLPENS     LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    CRCLPENS       LL_AHB4_GRP1_EnableClockLowPower\n
  *         AHB4LPENSR    BKPRAMLPENS    LL_AHB4_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->AHB4LPENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->AHB4LPENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB4 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll AHB4LPENR     GPIOALPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOBLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOCLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIODLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOELPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOFLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOGLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOHLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIONLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOOLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOPLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     GPIOQLPEN      LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     PWRLPEN        LL_AHB4_GRP1_IsEnabledClockLowPower\n
  *         AHB4LPENR     CRCLPEN        LL_AHB4_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB4_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB4LPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB4 peripherals clock during Low Power mode.
  * @rmtoll AHB4LPENCR    GPIOALPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOBLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOCLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIODLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOELPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOFLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOGLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOHLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIONLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOOLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOPLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    GPIOQLPENC     LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    PWRLPENC       LL_AHB4_GRP1_DisableClockLowPower\n
  *         AHB4LPENCR    CRCLPENC       LL_AHB4_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPION
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOO
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOP
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOQ
  *         @arg @ref LL_AHB4_GRP1_PERIPH_PWR
  *         @arg @ref LL_AHB4_GRP1_PERIPH_CRC
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB4LPENCR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB5 AHB5
  * @{
  */

/**
  * @brief  Enable AHB5 peripherals clock.
  * @rmtoll AHB5ENSR     HPDMA1ENS     LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     DMA2DENS      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     JPEGENS       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     FMCENS        LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     XSPI1ENS      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     PSSIENS       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     SDMMC2ENS     LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     SDMMC1ENS     LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     XSPI2ENS      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     XSPIMENS      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     MCE1ENS       LL_AHB5_GRP1_EnableClock\n (*)
  *         AHB5ENSR     MCE2ENS       LL_AHB5_GRP1_EnableClock\n (*)
  *         AHB5ENSR     MCE3ENS       LL_AHB5_GRP1_EnableClock\n (*)
  *         AHB5ENSR     XSPI3ENS      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     MCE4ENS       LL_AHB5_GRP1_EnableClock\n (*)
  *         AHB5ENSR     GFXMMUENS     LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     GPU2DENS      LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     ETH1MACENS    LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     ETH1TXENS     LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     ETH1RXENS     LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     ETH1ENS       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     OTG1ENS       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     OTGPHY1ENS    LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     OTGPHY2ENS    LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     OTG2ENS       LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     CACHEAXIENS   LL_AHB5_GRP1_EnableClock\n
  *         AHB5ENSR     NPUENS        LL_AHB5_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE1 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE2 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE3 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE4 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->AHB5ENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->AHB5ENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB5 peripheral clock is enabled or not
  * @rmtoll AHB5ENR      HPDMA1EN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      DMA2DEN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      JPEGEN        LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      FMCEN         LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      XSPI1EN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      PSSIEN        LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      SDMMC2EN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      SDMMC1EN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      XSPI2EN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      XSPIMEN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      MCE1EN        LL_AHB5_GRP1_IsEnabledClock\n (*)
  *         AHB5ENR      MCE2EN        LL_AHB5_GRP1_IsEnabledClock\n (*)
  *         AHB5ENR      MCE3EN        LL_AHB5_GRP1_IsEnabledClock\n (*)
  *         AHB5ENR      XSPI3EN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      MCE4EN        LL_AHB5_GRP1_IsEnabledClock\n (*)
  *         AHB5ENR      GFXMMUEN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      GPU2DEN       LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      ETH1MACEN     LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      ETH1TXEN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      ETH1RXEN      LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      ETH1EN        LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      OTG1EN        LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      OTGPHY1EN     LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      OTGPHY2EN     LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      OTG2EN        LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      CACHEAXIEN    LL_AHB5_GRP1_IsEnabledClock\n
  *         AHB5ENR      NPUEN         LL_AHB5_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE1 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE2 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE3 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE4 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  *
  *         (*) value not defined in all devices.
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB5_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB5ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

