micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  * @brief  Disable AHB5 peripherals clock.
  * @rmtoll AHB5ENCR     HPDMA1ENC     LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     DMA2DENC      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     JPEGENC       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     FMCENC        LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     XSPI1ENC      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     PSSIENC       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     SDMMC2ENC     LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     SDMMC1ENC     LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     XSPI2ENC      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     XSPIMENC      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     MCE1ENC       LL_AHB5_GRP1_DisableClock\n (*)
  *         AHB5ENCR     MCE2ENC       LL_AHB5_GRP1_DisableClock\n (*)
  *         AHB5ENCR     MCE3ENC       LL_AHB5_GRP1_DisableClock\n (*)
  *         AHB5ENCR     XSPI3ENC      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     MCE4ENC       LL_AHB5_GRP1_DisableClock\n (*)
  *         AHB5ENCR     GFXMMUENC     LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     GPU2DENC      LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     ETH1MACENC    LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     ETH1TXENC     LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     ETH1RXENC     LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     ETH1ENC       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     OTG1ENC       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     OTGPHY1ENC    LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     OTGPHY2ENC    LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     OTG2ENC       LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     CACHEAXIENC   LL_AHB5_GRP1_DisableClock\n
  *         AHB5ENCR     NPUENC        LL_AHB5_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE1 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE2 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE3 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE4 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB5ENCR, Periphs);
}

/**
  * @brief  Force AHB5 peripherals reset.
  * @rmtoll AHB5RSTSR    HPDMA1RSTS      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    DMA2DRSTS       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    JPEGRSTS        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    FMCRSTS         LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    XSPI1RSTS       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    PSSIRSTS        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    SDMMC2RSTS      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    SDMMC1RSTS      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    XSPI2RSTS       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    XSPIMRSTS       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    XSPI3RSTS       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    GFXMMURSTS      LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    GPU2DRSTS       LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    OTG1PHYCTLRSTS  LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    OTG2PHYCTLRSTS  LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    ETH1RSTS        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    OTG1RSTS        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    OTGPHY1RSTS     LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    OTGPHY2RSTS     LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    OTG2RSTS        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    CACHEAXIRSTS    LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSR    NPURSTS         LL_AHB5_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1PHYCTL
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2PHYCTL
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB5RSTSR, Periphs);
}

/**
  * @brief  Release AHB5 peripherals reset.
  * @rmtoll AHB5RSTCR    HPDMA1RSTC      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    DMA2DRSTC       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    JPEGRSTC        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    FMCRSTC         LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    XSPI1RSTC       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    PSSIRSTC        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    SDMMC2RSTC      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    SDMMC1RSTC      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    XSPI2RSTC       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    XSPIMRSTC       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    XSPI3RSTC       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    GFXMMURSTC      LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    GPU2DRSTC       LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    OTG1PHYCTLRSTC  LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    OTG2PHYCTLRSTC  LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    ETH1RSTC        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    OTG1RSTC        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    OTGPHY1RSTC     LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    OTGPHY2RSTC     LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    OTG2RSTC        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    CACHEAXIRSTC    LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCR    NPURSTS         LL_AHB5_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1PHYCTL
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2PHYCTL
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB5RSTCR, Periphs);
}

/**
  * @brief  Enable AHB5 peripherals clock during Low Power mode.
  * @rmtoll AHB5LPENSR   HPDMA1LPENS   LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   DMA2DLPENS    LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   JPEGLPENS     LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   FMCLPENS      LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   XSPI1LPENS    LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   PSSILPENS     LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   SDMMC2LPENS   LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   SDMMC1LPENS   LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   XSPI2LPENS    LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   XSPIMLPENS    LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   MCE1LPENS     LL_AHB5_GRP1_EnableClockLowPower\n (*)
  *         AHB5LPENSR   MCE2LPENS     LL_AHB5_GRP1_EnableClockLowPower\n (*)
  *         AHB5LPENSR   MCE3LPENS     LL_AHB5_GRP1_EnableClockLowPower\n (*)
  *         AHB5LPENSR   XSPI3LPENS    LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   MCE4LPENS     LL_AHB5_GRP1_EnableClockLowPower\n (*)
  *         AHB5LPENSR   GFXMMULPENS   LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   GPU2DLPENS    LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   ETH1MACLPENS  LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   ETH1TXLPENS   LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   ETH1RXLPENS   LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   ETH1LPENS     LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   OTG1LPENS     LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   OTGPHY1LPENS  LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   OTGPHY2LPENS  LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   OTG2LPENS     LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   CACHEAXILPENS LL_AHB5_GRP1_EnableClockLowPower\n
  *         AHB5LPENSR   NPULPENS      LL_AHB5_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE1 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE2 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE3 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE4 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->AHB5LPENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->AHB5LPENR);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB5 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll AHB5LPENR    HPDMA1LPEN    LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    DMA2DLPEN     LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    JPEGLPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    FMCLPEN       LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    XSPI1LPEN     LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    PSSILPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    SDMMC2LPEN    LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    SDMMC1LPEN    LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    XSPI2LPEN     LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    XSPIMLPEN     LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    MCE1LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n (*)
  *         AHB5LPENR    MCE2LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n (*)
  *         AHB5LPENR    MCE3LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n (*)
  *         AHB5LPENR    XSPI3LPEN     LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    MCE4LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n (*)
  *         AHB5LPENR    GFXMMULPEN    LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    GPU2DLPEN     LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    ETH1MACLPEN   LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    ETH1TXLPEN    LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    ETH1RXLPEN    LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    ETH1LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    OTG1LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    OTGPHY1LPEN   LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    OTGPHY2LPEN   LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    OTG2LPEN      LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    CACHEAXILPEN  LL_AHB5_GRP1_IsEnabledClockLowPower\n
  *         AHB5LPENR    NPULPEN       LL_AHB5_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE1 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE2 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE3 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE4 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  *
  *         (*) value not defined in all devices.
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_AHB5_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB5LPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB5 peripherals clock during Low Power mode.
  * @rmtoll AHB5LPENCR   HPDMA1LPENC   LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   DMA2DLPENC    LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   JPEGLPENC     LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   FMCLPENC      LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   XSPI1LPENC    LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   PSSILPENC     LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   SDMMC2LPENC   LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   SDMMC1LPENC   LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   XSPI2LPENC    LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   XSPIMLPENC    LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   MCE1LPENC     LL_AHB5_GRP1_DisableClockLowPower\n (*)
  *         AHB5LPENCR   MCE2LPENC     LL_AHB5_GRP1_DisableClockLowPower\n (*)
  *         AHB5LPENCR   MCE3LPENC     LL_AHB5_GRP1_DisableClockLowPower\n (*)
  *         AHB5LPENCR   XSPI3LPENC    LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   MCE4LPENC     LL_AHB5_GRP1_DisableClockLowPower\n (*)
  *         AHB5LPENCR   GFXMMULPENC   LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   GPU2DLPENC    LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   ETH1MACLPENC  LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   ETH1TXLPENC   LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   ETH1RXLPENC   LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   ETH1LPENC     LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   OTG1LPENC     LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   OTGPHY1LPENC  LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   OTGPHY2LPENC  LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   OTG2LPENC     LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   CACHEAXILPENC LL_AHB5_GRP1_DisableClockLowPower\n
  *         AHB5LPENCR   NPULPENC      LL_AHB5_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HPDMA1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_DMA2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_JPEG
  *         @arg @ref LL_AHB5_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPI3
  *         @arg @ref LL_AHB5_GRP1_PERIPH_XSPIM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PSSI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE1 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE2 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE3 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_MCE4 (*)
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GFXMMU
  *         @arg @ref LL_AHB5_GRP1_PERIPH_GPU2D
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTG2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_OTGPHY2
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CACHEAXI
  *         @arg @ref LL_AHB5_GRP1_PERIPH_NPU
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB5LPENCR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1 APB1
  * @{
  */

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll APB1ENSR1    TIM2ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM3ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM4ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM5ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM6ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM7ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM12ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM13ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM14ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    LPTIM1ENS     LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    WWDGENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM10ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    TIM11ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    SPI2ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    SPI3ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    SPDIFRX1ENS   LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    USART2ENS     LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    USART3ENS     LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    UART4ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    UART5ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    I2C1ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    I2C2ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    I2C3ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    I3C1ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    I3C2ENS       LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    UART7ENS      LL_APB1_GRP1_EnableClock\n
  *         APB1ENSR1    UART8ENS      LL_APB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB1ENSR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB1ENR1);
  (void)tmpreg;
}

