micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll APB1ENR1     TIM2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM3EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM4EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM5EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM6EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM7EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM12EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM13EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM14EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     LPTIM1EN      LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     WWDGEN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM10EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     TIM11EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     SPI2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     SPI3EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     SPDIFRX1EN    LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     USART2EN      LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     USART3EN      LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     UART4EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     UART5EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     I2C1EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     I2C2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     I2C3EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     I3C1EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     I3C2EN        LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     UART7EN       LL_APB1_GRP1_IsEnabledClock\n
  *         APB1ENR1     UART8EN       LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1ENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll APB1ENCR1    TIM2ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM3ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM4ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM5ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM6ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM7ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM12ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM13ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM14ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    LPTIM1ENC     LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM10ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    TIM11ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    SPI2ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    SPI3ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    SPDIFRX1ENC   LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    USART2ENC     LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    USART3ENC     LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    UART4ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    UART5ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    I2C1ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    I2C2ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    I2C3ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    I3C1ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    I3C2ENC       LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    UART7ENC      LL_APB1_GRP1_DisableClock\n
  *         APB1ENCR1    UART8ENC      LL_APB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1ENCR1, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1RSTSR1   TIM2RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM3RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM4RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM5RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM6RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM7RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM12RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM13RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM14RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   LPTIM1RSTS    LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM10RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   TIM11RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   SPI2RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   SPI3RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   SPDIFRX1RSTS  LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   USART2RSTS    LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   USART3RSTS    LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   UART4RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   UART5RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   I2C1RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   I2C2RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   I2C3RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   I3C1RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   I3C2RSTS      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   UART7RSTS     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSR1   UART8RSTS     LL_APB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTSR1, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll APB1RSTCR1   TIM2RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM3RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM4RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM5RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM6RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM7RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM12RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM13RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM14RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   LPTIM1RSTC    LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM10RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   TIM11RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   SPI2RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   SPI3RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   SPDIFRX1RSTC  LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   USART2RSTC    LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   USART3RSTC    LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   UART4RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   UART5RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   I2C1RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   I2C2RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   I2C3RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   I3C1RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   I3C2RSTC      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   UART7RSTC     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCR1   UART8RSTC     LL_APB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTCR1, Periphs);
}

/**
  * @brief  Enable APB1 peripherals clock during Low Power mode.
  * @rmtoll APB1LPENSR1  TIM2LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM3LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM4LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM5LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM6LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM7LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM12LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM13LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM14LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  LPTIM1LPENS   LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  WWDGLPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM10LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  TIM11LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  SPI2LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  SPI3LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  SPDIFRX1LPENS LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  USART2LPENS   LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  USART3LPENS   LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  UART4LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  UART5LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  I2C1LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  I2C2LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  I2C3LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  I3C1LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  I3C2LPENS     LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  UART7LPENS    LL_APB1_GRP1_EnableClockLowPower\n
  *         APB1LPENSR1  UART8LPENS    LL_APB1_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB1LPENSR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB1LPENR1);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll APB1LPENR1   TIM2LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM3LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM4LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM5LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM6LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM7LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM12LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM13LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM14LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   LPTIM1LPEN    LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   WWDGLPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM10LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   TIM11LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   SPI2LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   SPI3LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   SPDIFRX1LPEN  LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   USART2LPEN    LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   USART3LPEN    LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   UART4LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   UART5LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   I2C1LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   I2C2LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   I2C3LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   I3C1LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   I3C2LPEN      LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   UART7LPEN     LL_APB1_GRP1_IsEnabledClockLowPower\n
  *         APB1LPENR1   UART8LPEN     LL_APB1_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1LPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

