micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  * @brief  Disable APB1 peripherals clock during Low Power mode.
  * @rmtoll APB1LPENCR1  TIM2LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM3LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM4LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM5LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM6LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM7LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM12LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM13LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM14LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  LPTIM1LPENC   LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  WWDGLPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM10LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  TIM11LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  SPI2LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  SPI3LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  SPDIFRX1LPENC LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  USART2LPENC   LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  USART3LPENC   LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  UART4LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  UART5LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  I2C1LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  I2C2LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  I2C3LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  I3C1LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  I3C2LPENC     LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  UART7LPENC    LL_APB1_GRP1_DisableClockLowPower\n
  *         APB1LPENCR1  UART8LPENC    LL_APB1_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIFRX1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM10
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM11
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1LPENCR1, Periphs);
}

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll APB1ENSR2    MDIOSENS      LL_APB1_GRP2_EnableClock\n
  *         APB1ENSR2    FDCANENS      LL_APB1_GRP2_EnableClock\n
  *         APB1ENSR2    UCPD1ENS      LL_APB1_GRP2_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB1ENSR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB1ENR2);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll APB1ENR2     MDIOSEN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB1ENR2     FDCANEN       LL_APB1_GRP2_IsEnabledClock\n
  *         APB1ENR2     UCPD1EN       LL_APB1_GRP2_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1ENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll APB1ENCR2    MDIOSENC      LL_APB1_GRP2_DisableClock\n
  *         APB1ENCR2    FDCANENC      LL_APB1_GRP2_DisableClock\n
  *         APB1ENCR2    UCPD1ENC      LL_APB1_GRP2_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1ENCR2, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1RSTSR2   MDIOSRSTS     LL_APB1_GRP2_ForceReset\n
  *         APB1RSTSR2   FDCANRSTS     LL_APB1_GRP2_ForceReset\n
  *         APB1RSTSR2   UCPD1RSTS     LL_APB1_GRP2_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTSR2, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll APB1RSTCR2   MDIOSRSTC     LL_APB1_GRP2_ReleaseReset\n
  *         APB1RSTCR2   FDCANRSTC     LL_APB1_GRP2_ReleaseReset\n
  *         APB1RSTCR2   UCPD1RSTC     LL_APB1_GRP2_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTCR2, Periphs);
}

/**
  * @brief  Enable APB1 peripherals clock during Low Power mode.
  * @rmtoll APB1LPENSR2  MDIOSLPENS    LL_APB1_GRP2_EnableClockLowPower\n
  *         APB1LPENSR2  FDCANLPENS    LL_APB1_GRP2_EnableClockLowPower\n
  *         APB1LPENSR2  UCPD1LPENS    LL_APB1_GRP2_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB1LPENSR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB1LPENR2);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll APB1LPENR2   MDIOSLPEN     LL_APB1_GRP2_IsEnabledClockLowPower\n
  *         APB1LPENR2   FDCANLPEN     LL_APB1_GRP2_IsEnabledClockLowPower\n
  *         APB1LPENR2   UCPD1LPEN     LL_APB1_GRP2_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1LPENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripherals clock during Low Power mode.
  * @rmtoll APB1LPENCR2  MDIOSLPENC    LL_APB1_GRP2_DisableClockLowPower\n
  *         APB1LPENCR2  FDCANLPENC    LL_APB1_GRP2_DisableClockLowPower\n
  *         APB1LPENCR2  UCPD1LPENC    LL_APB1_GRP2_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_MDIOS
  *         @arg @ref LL_APB1_GRP2_PERIPH_UCPD1
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1LPENCR2, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */

/**
  * @brief  Enable APB2 peripherals clock.
  * @rmtoll APB2ENSR     TIM1ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     TIM8ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     USART1ENS     LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     USART6ENS     LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     UART9ENS      LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     USART10ENS    LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     SPI1ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     SPI4ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     TIM18ENS      LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     TIM15ENS      LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     TIM16ENS      LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     TIM17ENS      LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     TIM9ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     SPI5ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     SAI1ENS       LL_APB2_GRP1_EnableClock\n
  *         APB2ENSR     SAI2ENS       LL_APB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB2ENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB2ENR);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @rmtoll APB2ENR      TIM1EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM8EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      USART6EN      LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      UART9EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      USART10EN     LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SPI4EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM18EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM15EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM16EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM17EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM9EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SPI5EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SAI1EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SAI2EN        LL_APB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @rmtoll APB2ENCR     TIM1ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     TIM8ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     USART1ENC     LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     USART6ENC     LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     UART9ENC      LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     USART10ENC    LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     SPI1ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     SPI4ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     TIM18ENC      LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     TIM15ENC      LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     TIM16ENC      LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     TIM17ENC      LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     TIM9ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     SPI5ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     SAI1ENC       LL_APB2_GRP1_DisableClock\n
  *         APB2ENCR     SAI2ENC       LL_APB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->APB2ENCR, Periphs);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @rmtoll APB2RSTSR    TIM1RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    TIM8RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    USART1RSTS    LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    USART6RSTS    LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    UART9RSTS     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    USART10RSTS   LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    SPI1RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    SPI4RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    TIM18RSTS     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    TIM15RSTS     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    TIM16RSTS     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    TIM17RSTS     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    TIM9RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    SPI5RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    SAI1RSTS      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTSR    SAI2RSTS      LL_APB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB2RSTSR, Periphs);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @rmtoll APB2RSTCR    TIM1RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    TIM8RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    USART1RSTC    LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    USART6RSTC    LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    UART9RSTC     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    USART10RSTC   LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    SPI1RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    SPI4RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    TIM18RSTC     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    TIM15RSTC     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    TIM16RSTC     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    TIM17RSTC     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    TIM9RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    SPI5RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    SAI1RSTC      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTCR    SAI2RSTC      LL_APB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB2RSTCR, Periphs);
}

/**
  * @brief  Enable APB2 peripherals clock during Low Power mode.
  * @rmtoll APB2LPENSR   TIM1LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   TIM8LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   USART1LPENS   LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   USART6LPENS   LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   UART9LPENS    LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   USART10LPENS  LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   SPI1LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   SPI4LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   TIM18LPENS    LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   TIM15LPENS    LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   TIM16LPENS    LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   TIM17LPENS    LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   TIM9LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   SPI5LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   SAI1LPENS     LL_APB2_GRP1_EnableClockLowPower\n
  *         APB2LPENSR   SAI2LPENS     LL_APB2_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB2LPENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB2LPENR);
  (void)tmpreg;
}

