micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  * @brief  Check if APB2 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll APB2LPENR    TIM1LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    TIM8LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    USART1LPEN    LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    USART6LPEN    LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    UART9LPEN     LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    USART10LPEN   LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    SPI1LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    SPI4LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    TIM18LPEN     LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    TIM15LPEN     LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    TIM16LPEN     LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    TIM17LPEN     LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    TIM9LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    SPI5LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    SAI1LPEN      LL_APB2_GRP1_IsEnabledClockLowPower\n
  *         APB2LPENR    SAI2LPEN      LL_APB2_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2LPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripherals clock during Low Power mode.
  * @rmtoll APB2LPENCR   TIM1LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   TIM8LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   USART1LPENC   LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   USART6LPENC   LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   UART9LPENC    LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   USART10LPENC  LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   SPI1LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   SPI4LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   TIM18LPENC    LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   TIM15LPENC    LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   TIM16LPENC    LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   TIM17LPENC    LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   TIM9LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   SPI5LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   SAI1LPENC     LL_APB2_GRP1_DisableClockLowPower\n
  *         APB2LPENCR   SAI2LPENC     LL_APB2_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM18
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_UART9
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART10
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->APB2LPENCR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB4 APB4
  * @{
  */

/**
  * @brief  Enable APB4 peripherals clock.
  * @rmtoll APB4ENSR1    HDPENS        LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    LPUART1ENS    LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    SPI6ENS       LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    I2C4ENS       LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    LPTIM2ENS     LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    LPTIM3ENS     LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    LPTIM4ENS     LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    LPTIM5ENS     LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    VREFBUFENS    LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    RTCENS        LL_APB4_GRP1_EnableClock\n
  *         APB4ENSR1    RTCAPBENS     LL_APB4_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTC
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB4ENSR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB4ENR1);
  (void)tmpreg;
}

/**
  * @brief  Check if APB4 peripheral clock is enabled or not
  * @rmtoll APB4ENR1     HDPEN         LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     LPUART1EN     LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     SPI6EN        LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     I2C4EN        LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     LPTIM2EN      LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     LPTIM3EN      LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     LPTIM4EN      LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     LPTIM5EN      LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     VREFBUFEN     LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     RTCEN         LL_APB4_GRP1_IsEnabledClock\n
  *         APB4ENR1     RTCAPBEN      LL_APB4_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTC
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB4_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB4ENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB4 peripherals clock.
  * @rmtoll APB4ENCR1    HDPENC        LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    LPUART1ENC    LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    SPI6ENC       LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    I2C4ENC       LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    LPTIM2ENC     LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    LPTIM3ENC     LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    LPTIM4ENC     LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    LPTIM5ENC     LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    VREFBUFENC    LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    RTCENC        LL_APB4_GRP1_DisableClock\n
  *         APB4ENCR1    RTCAPBENC     LL_APB4_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTC
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4ENCR1, Periphs);
}

/**
  * @brief  Force APB4 peripherals reset.
  * @rmtoll APB4RSTSR1   HDPRSTS       LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   LPUART1RSTS   LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   SPI6RSTS      LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   I2C4RSTS      LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   LPTIM2RSTS    LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   LPTIM3RSTS    LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   LPTIM4RSTS    LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   LPTIM5RSTS    LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   VREFBUFRSTS   LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSR1   RTCAPBRSTS    LL_APB4_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4RSTSR1, Periphs);
}

/**
  * @brief  Release APB4 peripherals reset.
  * @rmtoll APB4RSTCR1   HDPRSTC       LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   LPUART1RSTC   LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   SPI6RSTC      LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   I2C4RSTC      LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   LPTIM2RSTC    LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   LPTIM3RSTC    LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   LPTIM4RSTC    LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   LPTIM5RSTC    LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   VREFBUFRSTC   LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCR1   RTCAPBRSTC    LL_APB4_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4RSTCR1, Periphs);
}

/**
  * @brief  Enable APB4 peripherals clock during Low Power mode.
  * @rmtoll APB4LPENSR1  HDPLPENS      LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  LPUART1LPENS  LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  SPI6LPENS     LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  I2C4LPENS     LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  LPTIM2LPENS   LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  LPTIM3LPENS   LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  LPTIM4LPENS   LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  LPTIM5LPENS   LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  VREFBUFLPENS  LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  RTCLPENS      LL_APB4_GRP1_EnableClockLowPower\n
  *         APB4LPENSR1  RTCAPBLPENS   LL_APB4_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTC
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB4LPENSR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB4LPENR1);
  (void)tmpreg;
}

/**
  * @brief  Check if APB4 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll APB4LPENR1   HDPLPEN       LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   LPUART1LPEN   LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   SPI6LPEN      LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   I2C4LPEN      LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   LPTIM2LPEN    LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   LPTIM3LPEN    LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   LPTIM4LPEN    LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   LPTIM5LPEN    LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   VREFBUFLPEN   LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   RTCLPEN       LL_APB4_GRP1_IsEnabledClockLowPower\n
  *         APB4LPENR1   RTCAPBLPEN    LL_APB4_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTC
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB4_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB4LPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB4 peripherals clock during Low Power mode.
  * @rmtoll APB4LPENCR1  HDPLPENC      LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  LPUART1LPENC  LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  SPI6LPENC     LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  I2C4LPENC     LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  LPTIM2LPENC   LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  LPTIM3LPENC   LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  LPTIM4LPENC   LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  LPTIM5LPENC   LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  VREFBUFLPENC  LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  RTCLPENC      LL_APB4_GRP1_DisableClockLowPower\n
  *         APB4LPENCR1  RTCAPBLPENC   LL_APB4_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_HDP
  *         @arg @ref LL_APB4_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPTIM5
  *         @arg @ref LL_APB4_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTC
  *         @arg @ref LL_APB4_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB4_GRP1_PERIPH_SPI6
  *         @arg @ref LL_APB4_GRP1_PERIPH_VREFBUF
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4LPENCR1, Periphs);
}

/**
  * @brief  Enable APB4 peripherals clock.
  * @rmtoll APB4ENSR2    SYSCFGENS     LL_APB4_GRP2_EnableClock\n
  *         APB4ENSR2    BSECENS       LL_APB4_GRP2_EnableClock\n
  *         APB4ENSR2    DTSENS        LL_APB4_GRP2_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_BSEC
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB4ENSR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB4ENR2);
  (void)tmpreg;
}

/**
  * @brief  Check if APB4 peripheral clock is enabled or not
  * @rmtoll APB4ENR2     SYSCFGEN      LL_APB4_GRP2_IsEnabledClock\n
  *         APB4ENR2     BSECEN        LL_APB4_GRP2_IsEnabledClock\n
  *         APB4ENR2     DTSEN         LL_APB4_GRP2_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_BSEC
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB4_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB4ENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB4 peripherals clock.
  * @rmtoll APB4ENCR2    SYSCFGENC     LL_APB4_GRP2_DisableClock\n
  *         APB4ENCR2    BSECENC       LL_APB4_GRP2_DisableClock\n
  *         APB4ENCR2    DTSENC        LL_APB4_GRP2_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_BSEC
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP2_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4ENCR2, Periphs);
}

/**
  * @brief  Force APB4 peripherals reset.
  * @rmtoll APB4RSTR2   SYSCFGRSTS    LL_APB4_GRP2_ForceReset\n
  *         APB4RSTR2   DTSRSTS       LL_APB4_GRP2_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP2_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4RSTSR2, Periphs);
}

/**
  * @brief  Release APB4 peripherals reset.
  * @rmtoll APB4RSTCR2   SYSCFGRSTC    LL_APB4_GRP2_ReleaseReset\n
  *         APB4RSTCR2   DTSRSTC       LL_APB4_GRP2_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP2_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4RSTCR2, Periphs);
}

/**
  * @brief  Enable APB4 peripherals clock during Low Power mode.
  * @rmtoll APB4LPENSR2  SYSCFGLPENS   LL_APB4_GRP2_EnableClockLowPower\n
  *         APB4LPENSR2  BSECLPENS     LL_APB4_GRP2_EnableClockLowPower\n
  *         APB4LPENSR2  DTSLPENS      LL_APB4_GRP2_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_BSEC
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP2_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB4LPENSR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB4LPENR2);
  (void)tmpreg;
}

/**
  * @brief  Check if APB4 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll APB4LPENR2   SYSCFGLPEN    LL_APB4_GRP2_IsEnabledClockLowPower\n
  *         APB4LPENR2   BSECLPEN      LL_APB4_GRP2_IsEnabledClockLowPower\n
  *         APB4LPENR2   DTSLPEN       LL_APB4_GRP2_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_BSEC
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB4_GRP2_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB4LPENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB4 peripherals clock during Low Power mode.
  * @rmtoll APB4LPENCR2  SYSCFGLPENC   LL_APB4_GRP2_DisableClockLowPower\n
  *         APB4LPENCR2  BSECLPENC     LL_APB4_GRP2_DisableClockLowPower\n
  *         APB4LPENCR2  DTSLPENC      LL_APB4_GRP2_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP2_PERIPH_BSEC
  *         @arg @ref LL_APB4_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB4_GRP2_PERIPH_DTS
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP2_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4LPENCR2, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB5 APB5
  * @{
  */

/**
  * @brief  Enable APB5 peripherals clock.
  * @rmtoll APB5ENSR     LTDCENS       LL_APB5_GRP1_EnableClock\n
  *         APB5ENSR     DCMIPPENS     LL_APB5_GRP1_EnableClock\n
  *         APB5ENSR     GFXTIMENS     LL_APB5_GRP1_EnableClock\n
  *         APB5ENSR     VENCENS       LL_APB5_GRP1_EnableClock\n (*)
  *         APB5ENSR     CSIENS        LL_APB5_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB5ENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB5ENR);
  (void)tmpreg;
}

