micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_bus.h
/**
  * @brief  Check if APB5 peripheral clock is enabled or not
  * @rmtoll APB5ENR      LTDCEN        LL_APB5_GRP1_IsEnabledClock\n
  *         APB5ENR      DCMIPPEN      LL_APB5_GRP1_IsEnabledClock\n
  *         APB5ENR      GFXTIMEN      LL_APB5_GRP1_IsEnabledClock\n
  *         APB5ENR      VENCEN        LL_APB5_GRP1_IsEnabledClock\n (*)
  *         APB5ENR      CSIEN         LL_APB5_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB5_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB5ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB5 peripherals clock.
  * @rmtoll APB5ENCR     LTDCENC       LL_APB5_GRP1_DisableClock\n
  *         APB5ENCR     DCMIPPENC     LL_APB5_GRP1_DisableClock\n
  *         APB5ENCR     GFXTIMENC     LL_APB5_GRP1_DisableClock\n
  *         APB5ENCR     VENCENC       LL_APB5_GRP1_DisableClock\n (*)
  *         APB5ENCR     CSIENC        LL_APB5_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->APB5ENCR, Periphs);
}

/**
  * @brief  Force APB5 peripherals reset.
  * @rmtoll APB5RSTSR     LTDCRSTS       LL_APB5_GRP1_ForceReset\n
  *         APB5RSTSR     DCMIPPRSTS     LL_APB5_GRP1_ForceReset\n
  *         APB5RSTSR     GFXTIMRSTS     LL_APB5_GRP1_ForceReset\n
  *         APB5RSTSR     VENCRSTS       LL_APB5_GRP1_ForceReset\n (*)
  *         APB5RSTSR     CSIRSTS        LL_APB5_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB5RSTSR, Periphs);
}

/**
  * @brief  Release APB5 peripherals reset.
  * @rmtoll APB5RSTCR     LTDCRSTC       LL_APB5_GRP1_ReleaseReset\n
  *         APB5RSTCR     DCMIPPRSTC     LL_APB5_GRP1_ReleaseReset\n
  *         APB5RSTCR     GFXTIMRSTC     LL_APB5_GRP1_ReleaseReset\n
  *         APB5RSTCR     VENCRSTC       LL_APB5_GRP1_ReleaseReset\n (*)
  *         APB5RSTCR     CSIRSTC        LL_APB5_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB5RSTCR, Periphs);
}

/**
  * @brief  Enable APB5 peripherals clock during Low Power mode.
  * @rmtoll APB5LPENSR    LTDCLPENS      LL_APB5_GRP1_EnableClockLowPower\n
  *         APB5LPENSR    DCMIPPLPENS    LL_APB5_GRP1_EnableClockLowPower\n
  *         APB5LPENSR    GFXTIMLPENS    LL_APB5_GRP1_EnableClockLowPower\n
  *         APB5LPENSR    VENCLPENS      LL_APB5_GRP1_EnableClockLowPower\n (*)
  *         APB5LPENSR    CSILPENS       LL_APB5_GRP1_EnableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_EnableClockLowPower(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->APB5LPENSR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_REG(RCC->APB5LPENR);
  (void)tmpreg;
}

/**
  * @brief  Check if APB5 peripheral clock during Low Power mode is enabled or not .
  * @rmtoll APB5LPENR     LTDCLPEN       LL_APB5_GRP1_IsEnabledClockLowPower\n
  *         APB5LPENR     DCMIPPLPEN     LL_APB5_GRP1_IsEnabledClockLowPower\n
  *         APB5LPENR     GFXTIMLPEN     LL_APB5_GRP1_IsEnabledClockLowPower\n
  *         APB5LPENR     VENCLPEN       LL_APB5_GRP1_IsEnabledClockLowPower\n (*)
  *         APB5LPENR     CSILPEN        LL_APB5_GRP1_IsEnabledClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_APB5_GRP1_IsEnabledClockLowPower(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB5LPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB5 peripherals clock during Low Power mode.
  * @rmtoll APB5LPENCR    LTDCLPENC      LL_APB5_GRP1_DisableClockLowPower\n
  *         APB5LPENCR    DCMIPPLPENC    LL_APB5_GRP1_DisableClockLowPower\n
  *         APB5LPENCR    GFXTIMLPENC    LL_APB5_GRP1_DisableClockLowPower\n
  *         APB5LPENCR    VENCLPENC      LL_APB5_GRP1_DisableClockLowPower\n (*)
  *         APB5LPENCR    CSILPENC       LL_APB5_GRP1_DisableClockLowPower
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_CSI
  *         @arg @ref LL_APB5_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB5_GRP1_PERIPH_GFXTIM
  *         @arg @ref LL_APB5_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB5_GRP1_PERIPH_VENC
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_DisableClockLowPower(uint32_t Periphs)
{
  WRITE_REG(RCC->APB5LPENCR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_MISC MISC
  * @{
  */

/**
  * @brief  Enable miscellaneous clock.
  * @rmtoll MISCENSR     DBGENS        LL_MISC_EnableClock\n
  *         MISCENSR     MCO1ENS       LL_MISC_EnableClock\n
  *         MISCENSR     MCO2ENS       LL_MISC_EnableClock\n
  *         MISCENSR     XSPIPHYCOMPENS LL_MISC_EnableClock\n
  *         MISCENSR     PERENS        LL_MISC_EnableClock
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_MCO1
  *         @arg @ref LL_MCO2
  *         @arg @ref LL_XSPIPHYCOMP
  *         @arg @ref LL_PER
  * @retval None
  */
__STATIC_INLINE void LL_MISC_EnableClock(uint32_t Misc)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MISCENSR, Misc);
  /* Delay after an RCC miscellaneous clock enabling */
  tmpreg = READ_REG(RCC->MISCENR);
  (void)tmpreg;
}

/**
  * @brief  Check if miscellaneous clock is enabled or not
  * @rmtoll MISCENR      DBGEN         LL_MISC_IsEnabledClock\n
  *         MISCENR      MCO1EN        LL_MISC_IsEnabledClock\n
  *         MISCENR      MCO2EN        LL_MISC_IsEnabledClock\n
  *         MISCENR      XSPIPHYCOMPEN LL_MISC_IsEnabledClock\n
  *         MISCENR      PEREN         LL_MISC_IsEnabledClock
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_MCO1
  *         @arg @ref LL_MCO2
  *         @arg @ref LL_XSPIPHYCOMP
  *         @arg @ref LL_PER
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_MISC_IsEnabledClock(uint32_t Misc)
{
  return ((READ_BIT(RCC->MISCENR, Misc) == Misc) ? 1UL : 0UL);
}

/**
  * @brief  Disable miscellaneous clock.
  * @rmtoll MISCENCR     DBGENC        LL_MISC_DisableClock\n
  *         MISCENCR     MCO1ENC       LL_MISC_DisableClock\n
  *         MISCENCR     MCO2ENC       LL_MISC_DisableClock\n
  *         MISCENCR     XSPIPHYCOMPENC LL_MISC_DisableClock\n
  *         MISCENCR     PERENC        LL_MISC_DisableClock
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_MCO1
  *         @arg @ref LL_MCO2
  *         @arg @ref LL_XSPIPHYCOMP
  *         @arg @ref LL_PER
  * @retval None
  */
__STATIC_INLINE void LL_MISC_DisableClock(uint32_t Misc)
{
  WRITE_REG(RCC->MISCENCR, Misc);
}

/**
  * @brief  Force miscellaneous reset.
  * @rmtoll MISCRSTSR    DBGRSTS       LL_MISC_ForceReset\n
  *         MISCRSTSR    XSPIPHY1RSTS  LL_MISC_ForceReset\n
  *         MISCRSTSR    XSPIPHY2RSTS  LL_MISC_ForceReset\n
  *         MISCRSTSR    SDMMC1DLLRSTS LL_MISC_ForceReset\n
  *         MISCRSTSR    SDMMC2DLLRSTS LL_MISC_ForceReset
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_XSPIPHY1
  *         @arg @ref LL_XSPIPHY2
  *         @arg @ref LL_SDMMC1DLL
  *         @arg @ref LL_SDMMC2DLL
  * @retval None
  */
__STATIC_INLINE void LL_MISC_ForceReset(uint32_t Misc)
{
  WRITE_REG(RCC->MISCRSTSR, Misc);
}

/**
  * @brief  Release miscellaneous reset.
  * @rmtoll MISCRSTCR    DBGRSTC       LL_MISC_ReleaseReset\n
  *         MISCRSTCR    XSPIPHY1RSTC  LL_MISC_ReleaseReset\n
  *         MISCRSTCR    XSPIPHY2RSTC  LL_MISC_ReleaseReset\n
  *         MISCRSTCR    SDMMC1DLLRSTC LL_MISC_ReleaseReset\n
  *         MISCRSTCR    SDMMC2DLLRSTC LL_MISC_ReleaseReset
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_XSPIPHY1
  *         @arg @ref LL_XSPIPHY2
  *         @arg @ref LL_SDMMC1DLL
  *         @arg @ref LL_SDMMC2DLL
  * @retval None
  */
__STATIC_INLINE void LL_MISC_ReleaseReset(uint32_t Misc)
{
  WRITE_REG(RCC->MISCRSTCR, Misc);
}

/**
  * @brief  Enable bus clock during Low Power mode.
  * @rmtoll MISCLPENSR   DBGLPENS      LL_MISC_EnableClockLowPower\n
  *         MISCLPENSR   XSPIPHYCOMPLPENS LL_MISC_EnableClockLowPower\n
  *         MISCLPENSR   PERLPENS      LL_MISC_EnableClockLowPower
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_XSPIPHYCOMP
  *         @arg @ref LL_PER
  * @retval None
  */
__STATIC_INLINE void LL_MISC_EnableClockLowPower(uint32_t Misc)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MISCLPENSR, Misc);
  /* Delay after an RCC miscellaneous clock enabling */
  tmpreg = READ_REG(RCC->MISCLPENR);
  (void)tmpreg;
}

/**
  * @brief  Disable bus clock during Low Power mode.
  * @rmtoll MISCLPENCR   DBGLPENC      LL_MISC_DisableClockLowPower\n
  *         MISCLPENCR   XSPIPHYCOMPLPENC LL_MISC_DisableClockLowPower\n
  *         MISCLPENCR   PERLPENC      LL_MISC_DisableClockLowPower
  * @param  Misc This parameter can be a combination of the following values:
  *         @arg @ref LL_DBG
  *         @arg @ref LL_XSPIPHYCOMP
  *         @arg @ref LL_PER
  * @retval None
  */
__STATIC_INLINE void LL_MISC_DisableClockLowPower(uint32_t Misc)
{
  WRITE_REG(RCC->MISCLPENCR, Misc);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_LL_BUS_H */
